Конфигурация/src/Documents/НачислениеОклада/НачислениеОклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОклада</name>
  <registerRecords>CalculationRegister.РегистрНачисленияЗарплаты</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПередСотрудниками</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДневнойТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/CalculationRegisters/РегистрНачисленияЗарплаты/РегистрНачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>РегистрНачисленияЗарплаты</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ГрафикПредприятия</schedule>
  <scheduleValue>InformationRegister.ГрафикПредприятия.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикПредприятия.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РасчетныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Конфигурация/src/AccumulationRegisters/ЗадолженностьПередСотрудниками/ЗадолженностьПередСотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженностьПередСотрудниками</name>
  <resources>
    <name>Долг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/НачислениеОклада/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.РегистрНачисленияЗарплаты.Записывать = Истина;
	Движение = Движения.РегистрНачисленияЗарплаты.Добавить();
	Движение.Сторно = Ложь;
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоТарифу;
	Движение.ПериодРегистрации = Дата;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = КонецМесяца(Дата);
	Движение.Сотрудник = Сотрудник;
	Движение.РасчетныеДанные = ДневнойТариф;

	движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрНачисленияЗарплатыДанныеГрафика.РасчетныеДанные,
		|	РегистрНачисленияЗарплатыДанныеГрафика.РабочийДеньФактическийПериодДействия КАК Факт
		|ИЗ
		|	РегистрРасчета.РегистрНачисленияЗарплаты.ДанныеГрафика(Регистратор = &Ссылка) КАК
		|		РегистрНачисленияЗарплатыДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Результат = ВыборкаДетальныеЗаписи.РасчетныеДанные * ВыборкаДетальныеЗаписи.Факт;
		Движение.Результат = Результат;
		
	КонецЕсли;
	
	Движения.РегистрНачисленияЗарплаты.Записать();
	
	Движение = Движения.ЗадолженностьПередСотрудниками.Записывать = Истина;
	Движение = Движения.ЗадолженностьПередСотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Сотрудник;
		Движение.Долг = Результат;
	
КонецПроцедуры
